jamesdabai/stm32_mp3/HARDWARE/dev_key.c
/********************************Copyright ( c ) ***************************
**                  Shenzhen Xinguodu Technology Co., LTD.
**                        http://www.xinguodu.com
**
**
**Created By:         xqy
**Created Date:       2017-12-13
**Version:            <version >
**Description:        移植键盘驱动到stm32中
**
****************************************************************************/



#include <stdarg.h>
#include <stdio.h>

#include "dev_key.h"
#include "stm32f4xx_gpio.h"
#include "dev_time.h"
#include "ddi.h"


#define Test_DRV_KEY
#ifdef Test_DRV_KEY
#define key_debug uart_printf
#else
#define key_debug(a,...)
#endif

struct _key_scan_ctr
{
    u32 old_sta;//键盘上一次稳定状态
    u32 new_sta;
    u8 col;//记录扫描的COL
    u8 deb;//防抖
};

static struct _key_scan_ctr KeyScnCtr;

//按键扫描的状态缓冲，
#define KEY_SCAN_STA_BUF_MAX 10
struct _key_scan_sta_buf
{
    struct _key_scan_sta chg[KEY_SCAN_STA_BUF_MAX];  
    u8 head;
    u8 end;
};

static struct _key_scan_sta_buf KeyChgBuf;

enum KEY_COL
{
    KEY_COL_0 = 0,
    KEY_COL_1,
    KEY_COL_2,
    KEY_COL_3,
    //KEY_COL_PWR,//专门用于扫描PWR键
    KEY_COL_MAX,
};

struct _key_value key_value[6] = 
{
    "取消",
    "清除",
    "上翻",
    "下翻",
    "确定",
    "开关机",
};


void key_init(void)
{    	 
  GPIO_InitTypeDef  GPIO_InitStructure;

  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);//使能GPIOE时钟

  //GPIOE7~E10初始化设置行输出
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10;//行输出
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;//普通输出模式
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO

  //GPIOE11~E14初始化设置列输入
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14;//列输入
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;//普通输入模式
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
	
  GPIO_SetBits(GPIOE,GPIO_Pin_7 | GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10);//

}



/****************************************************************************
**Description:      对指定 col输出0，其他输出1     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-3-20)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
static s32 drv_key_col_output(u8 col)
{
    u16 pin_data;
    GPIO_InitTypeDef  GPIO_InitStructure;
    
    //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10;//行输出
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;//普通输出模式
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
    
	//set col output 0
	pin_data = GPIO_Pin_7 |GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10;
	GPIO_SetBits(GPIOE,pin_data);//列输出1高电平
	
	
    #if 0 /*xqy 2017-12-13*/
    GPIO_WritePinOutput(KEY_COL_GPIO, PORTB0, HIGH_LEVEL);
	GPIO_WritePinOutput(KEY_COL_GPIO, PORTB1, HIGH_LEVEL);
	GPIO_WritePinOutput(KEY_COL_GPIO, PORTB2, HIGH_LEVEL);
	GPIO_WritePinOutput(KEY_COL_GPIO, PORTB3, HIGH_LEVEL);
    #endif


    if(col != KEY_COL_0)
    {
        #if 0 /*xqy 2017-12-13*/
        //DrvKeyDebug("COL 0 input\r\n");
		PORT_SetPinMux(KEY_COL_PORT, PORTB0, kPORT_MuxAsGpio);    // set as gpio
		GPIO_PinInit(KEY_COL_GPIO, PORTB0, &input_config);        // input
		pin_pull_Config.pullSelect = kPORT_PullUp;	
        pin_pull_Config.mux = kPORT_MuxAsGpio;
        PORT_SetPinConfig(PORTB, PORTB0, &pin_pull_Config);       // enable pull up
        #endif
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
        GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
		
    }

    if(col != KEY_COL_1)
    {
        #if 0 /*xqy 2017-12-13*/
        //DrvKeyDebug("COL 1 input\r\n");
		PORT_SetPinMux(KEY_COL_PORT, PORTB1, kPORT_MuxAsGpio);    // set as gpio
		GPIO_PinInit(KEY_COL_GPIO, PORTB1, &input_config);        // input
		pin_pull_Config.pullSelect = kPORT_PullUp;	
        pin_pull_Config.mux = kPORT_MuxAsGpio;
        PORT_SetPinConfig(PORTB, PORTB1, &pin_pull_Config);       // enable pull up	
        #endif
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
        GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
	
    }

    if(col != KEY_COL_2)
    {
        #if 0 /*xqy 2017-12-13*/
        //DrvKeyDebug("COL 2 input\r\n");
		PORT_SetPinMux(KEY_COL_PORT, PORTB2, kPORT_MuxAsGpio);    // set as gpio
		GPIO_PinInit(KEY_COL_GPIO, PORTB2, &input_config);        // input
		pin_pull_Config.pullSelect = kPORT_PullUp;	
        pin_pull_Config.mux = kPORT_MuxAsGpio;
        PORT_SetPinConfig(PORTB, PORTB2, &pin_pull_Config);       // enable pull up	
        #endif
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
        GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO

    }

    if(col != KEY_COL_3)
    {
        #if 0 /*xqy 2017-12-13*/
        //DrvKeyDebug("COL 3 input\r\n");
		PORT_SetPinMux(KEY_COL_PORT, PORTB3, kPORT_MuxAsGpio);    // set as gpio
		GPIO_PinInit(KEY_COL_GPIO, PORTB3, &input_config);        //set as  input
		pin_pull_Config.pullSelect = kPORT_PullUp;	
        pin_pull_Config.mux = kPORT_MuxAsGpio;
        PORT_SetPinConfig(PORTB, PORTB3, &pin_pull_Config);       // enable pull up	
        #endif
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
        GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO

    }

    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;//普通输出模式
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
    //DrvKeyDebug("key scan, next col output low:%d \r\n", col);
    switch(col)
    {
        case KEY_COL_0:
			
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
            GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
		    GPIO_ResetBits(GPIOE,GPIO_Pin_7);
            break;

        case KEY_COL_1:
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
            GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
		    GPIO_ResetBits(GPIOE,GPIO_Pin_8);
            break;

        case KEY_COL_2:
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
            GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
		    GPIO_ResetBits(GPIOE,GPIO_Pin_9);
            break;

        case KEY_COL_3:
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
            GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIO
		    GPIO_ResetBits(GPIOE,GPIO_Pin_10);
            break;
        
        default:
            key_debug("key scan err col\r\n");
            break;
    }
    return 0;
}

/****************************************************************************
**Description:        读ROW的值，结果右对齐     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-3-20)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
static s32 drv_key_row_read(u32 *status)
{
    u16 row_sta;

