jamesdabai/stm32_mp3/HARDWARE/dev_key.c
	row_sta = GPIO_ReadInputData(GPIOE);

	*status = (row_sta >> 11) & 0x0F;//取11到14位的数据
    return 0;
}
/****************************************************************************
**Description:       初始化按键扫描硬件     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-3-20)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
s32 drv_key_init(void)
{
    key_init();//初始化列和行
    drv_key_col_output(KEY_COL_0);
    KeyScnCtr.col = KEY_COL_0;
    KeyScnCtr.old_sta = 0XFFFFFFFF;//初始化为没有按键按下
    KeyScnCtr.new_sta = 0XFFFFFFFF;
    KeyScnCtr.deb = 0;
    KeyChgBuf.end = 0;
    KeyChgBuf.head = 0;
    return 0;
}

/****************************************************************************
**Description:      逐行扫描按键状态  仅仅上报状态，至于按键处理，由按键任务处理   
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-3-20)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
void drv_key_scan(void)
{
    u32 row_sta_tmp;
    
    static u32 row_sta = KEY_ROW_STA_INIT;//最多保存32键
    
    //读ROW
    drv_key_row_read(&row_sta_tmp);
    //key_debug("row sta:%d, %01x\r\n", KeyScnCtr.col, row_sta_tmp);
    row_sta += (row_sta_tmp & KEY_ROW_MASK)<<(KEY_ROW_NUM * KeyScnCtr.col);
    //下一COL输出0
    KeyScnCtr.col++;
    if(KeyScnCtr.col >= KEY_COL_MAX)
    {   
        row_sta_tmp = row_sta&0xFFFF;
        //key_debug("%s,%04x\r\n",(u8 *)"一轮" ,row_sta_tmp);
        KeyScnCtr.col = KEY_COL_0;
    }

    drv_key_col_output(KeyScnCtr.col);//处理COL输出
    
    if(KeyScnCtr.col == KEY_COL_0)//键盘所有COL都扫描了一遍
    {
        if(row_sta != KeyScnCtr.new_sta)
        {
            //DrvKeyDebug("不等\r\n");
            KeyScnCtr.new_sta = row_sta;  
            KeyScnCtr.deb = 0;
        }
        else if(row_sta != KeyScnCtr.old_sta)
        {
            KeyScnCtr.deb++;
            if(KeyScnCtr.deb>=2)
            {
                //将变化的键跟当前按键状态上报
                KeyChgBuf.chg[KeyChgBuf.head].chg = KeyScnCtr.old_sta^row_sta;//求出变化按键
                key_debug("chg:%04x, sta:%04x\r\n", KeyChgBuf.chg[KeyChgBuf.head].chg, row_sta);
                KeyChgBuf.chg[KeyChgBuf.head].sta = row_sta;
                KeyChgBuf.head++;
                if(KeyChgBuf.head >= KEY_SCAN_STA_BUF_MAX)
                    KeyChgBuf.head = 0;
                
                KeyScnCtr.old_sta = row_sta;
                KeyScnCtr.deb = 0;
            }
        }
        else
        {
            KeyScnCtr.deb = 0;    
        }

        row_sta = KEY_ROW_STA_INIT;
    }
}


/****************************************************************************
**Description:      读按键改变事件     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
s32 drv_key_chgsta_read(struct _key_scan_sta* chg)
{
    if(KeyChgBuf.head != KeyChgBuf.end)
    {
        chg->chg = KeyChgBuf.chg[KeyChgBuf.end].chg;
        chg->sta = KeyChgBuf.chg[KeyChgBuf.end].sta;
        KeyChgBuf.end++;
        if(KeyChgBuf.end >= KEY_SCAN_STA_BUF_MAX)
            KeyChgBuf.end = 0;
        return 1;
    }
    return 0;
}

/****************************************************************************
**Description:      打印按下的键     
**Input parameters:      
**Output parameters:     
**                       
**Returned value:        
**                       
**Created by:            xqy(2017-12-14)
**--------------------------------------------------------------------------
**Modified by:          
**Modified by:          
****************************************************************************/
void disp_keyvalue(u32 key)
{
    switch (key)
    {   
       case 0:
       case 1:
       case 2:
       case 3:
       case 4:
       case 5:
       case 6:
       case 7:
       case 8:
       case 9:
           uart_printf("按下:%d\n",key);
           break;
       case cancel:
       case clr   :
       case up    :
       case down  :
       case enter :
       case pwroff:
           uart_printf("按下:%s\n",(u8 *)key_value[key-10].name);
           break;
        default:
            break;
    }
}
#if 0 /*xqy 2017-12-13*/
/****************************************************************************
**Description:      进入低功耗前需要设置按键，以便按键唤醒     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-4-28)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
void drv_key_sleep(void)
{

    gpio_pin_config_t input_config = 
	{
        kGPIO_DigitalInput, 0,
    };

    gpio_pin_config_t output_config = 
	{
        kGPIO_DigitalOutput, LOW_LEVEL,
    };

    port_pin_config_t pin_pull_Config = {0};  //PULL UP
	pin_pull_Config.pullSelect = kPORT_PullUp;	
	pin_pull_Config.mux = kPORT_MuxAsGpio; 

    // row output 0
	PORT_SetPinMux(KEY_ROW_PORT, PORTB10, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_ROW_GPIO, PORTB10, &output_config);	  // set as  output
	//GPIO_WritePinOutput(KEY_ROW_GPIO, PORTB10, LOW_LEVEL);    // output 0	
	
	PORT_SetPinMux(KEY_ROW_PORT, PORTB11, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_ROW_GPIO, PORTB11, &output_config);	  // set as  output
	//GPIO_WritePinOutput(KEY_ROW_GPIO, PORTB11, LOW_LEVEL);    // output 0	

