jamesdabai/stm32_mp3/HARDWARE/dev_key.c
    return 0;
}

/****************************************************************************
**Description:      偷窥一下，看是否有按键     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-7-17)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
s32 dev_key_peek(u32 *lpKey)
{

    if(key_buf.head != key_buf.end)
    {
        *lpKey = key_buf.value[key_buf.end];
    }
    else
    {
        *lpKey = 0;
    }

    return 0;
    
}

/****************************************************************************
**Description:    写键值到缓冲       
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:          
**--------------------------------------------------------------------------
**Modified by: 2014.07.28 增加点亮按键与LCD背光功能。
**Modified by:      
****************************************************************************/
static s32 dev_key_write(u32 key)
{
    //dev_key_bl_on();
    //dev_lcd_bl_on();
        
    key_buf.value[key_buf.head++] = key;
    if(key_buf.head >= key_buf_max)
        key_buf.head = 0;
    return 0;
}


/****************************************************************************
**Description:       写一个开关机长按键值到缓冲    
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:      
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
s32 dev_key_wirte_power(void)
{
    dev_key_write(KEY_ONOFF_HOLD);   
    return 0;
}
/****************************************************************************
**Description:      控制按键
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_ioctl(u32 nCmd, u32 lParam, u32 wParam)
{
    s32 ret = DDI_OK;
#if 0
    switch(nCmd)
    {
    case DDI_KEY_CTL_LONGPRESS://设置长按键
        if(lParam == 0)//禁止长按键
        {
            KeyCtrl.longpress = 0;
        }
        else if(lParam == 1)//允许长按键
        {
            KeyCtrl.longpress = 1;
        }
        else
        {
            //参数错误
            ret = DDI_EINVAL;
        }
        break;

    case DDI_KEY_CTL_BKLIGHT://控制按键背光
        if((SysPwr.machine == MACHINE_G2)||(SysPwr.machine == MACHINE_G2_PT))
        {
            if(lParam == 0)//关
            {
                DevKeyDebug("dis 按键背光\r\n");
                dev_key_bl_dis();
            }
            else if(lParam == 1)//开
            {
                DevKeyDebug("en 按键背光\r\n");
                dev_key_bl_en();
            }
            else
            {
                //参数错误
                ret = DDI_EINVAL;
            }
        }
        break;

    case DDI_KEY_CTL_BKLIGHTTIME: //设置背光时间
        if((SysPwr.machine == MACHINE_G2)||(SysPwr.machine == MACHINE_G2_PT))
        {
            if(lParam > 255)
            {
                DevKeyDebug("设置背光时间参数错误\r\n");
                ret = DDI_EINVAL;
            }
            else
            {
                dev_key_bl_settime(lParam);
            }
        }
        break;

    case DDI_KEY_CTL_BKLIGHT_CTRL:
        if((SysPwr.machine == MACHINE_G2)||(SysPwr.machine == MACHINE_G2_PT))
        {
            if(lParam == 0)//熄灭
            {
                dev_key_bl_off(); 
                ret = DDI_OK;
            }
            else if(lParam == 1)//点亮
            {
                dev_key_bl_core_on();
                ret = DDI_OK;
            }
            else
            {
                ret = DDI_EINVAL;   
            }
        }
        break;
        
    default:
        ret = DDI_EINVAL;
        break;
    }
#endif
    return ret;
}


/****************************************************************************
**Description:      逐行扫描时，根据状态求键值
**Input parameters:  sta 按键状态
**Output parameters:
**
**Returned value: 键值
**
**Created by:            hxj(2014-3-20)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
static u32 dev_key_get_keyvalue(u32 sta)
{
    u32 key_value = 0;
    u32 key_sta;

    s8 i;
    u8 cnt;

    i = 15;//按键最大
    cnt = 0;
    while(i >= 0)
    {
        //key_debug("i=%d\n",i);
        key_sta = sta & (0x01<<(KeyPra[i].line_mask));
        if( key_sta == 0)
        {
            key_value = (key_value << 8)+i;
            cnt++;
            if(cnt >4)//最多4个键
            {
                key_value = 0;
                //key_debug("键值过多，跳出\n");
                break;
            }
        }
        i--;
    }
    //key_debug("返回值%08x\n",key_value);
    return key_value;
}
/****************************************************************************
**Description:      按键任务，用来处理长按键等任务
                    在CORE任务中调用
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
void dev_key_task(void)
{
    u32 key_value;
    s32 res;
    u8 i;
    u8 cnt;
    u32 lParam;
    struct _key_scan_sta key_chg_sta;

    static u8 onoff_sta = 0;//保证只执行一次
    static s32 timeid = 0;

    if(KeyGd == 0)//按键关闭状态，不扫描
        return;

    //处理按键变化
    res = drv_key_chgsta_read(&key_chg_sta);
    if(1 == res)
    {
        key_debug("chg: %04x, %04x\r\n", key_chg_sta.chg, key_chg_sta.sta);
    
        //变化
        //求按键
        if(((KeyCtrl.last_key_sta) | key_chg_sta.sta) == 0xffffffff)
        {

            //对于卡键的判断，要细化 任意一个按键一直按住，都认为是卡键
            //只有跟上次的按键状态完全不一样时，才更新卡键时间
            KeyCtrl.holdtime = dev_get_timeID();//每次按键状态改变都更新
            key_debug("当前时基为%d\r\n", KeyCtrl.holdtime);
        }
        //求出键值
        (KeyCtrl.last_key_sta) = key_chg_sta.sta;
        key_value = dev_key_get_keyvalue(key_chg_sta.sta);
        KeyCtrl.lastkey = key_value;
        key_debug("按下 %d\r\n", key_value);
        if((key_chg_sta.chg & key_chg_sta.sta) == 0)
        {
            //按下
            key_debug("按下 %08x\r\n", key_value);
            if(KeyCtrl.holdflag == 0)//没有卡键
            {
                key_debug("写一个键值%d\r\n", key_value);
                dev_key_write(key_value);
            }
            KeyCtrl.keysta = 1;

