jamesdabai/stm32_mp3/HARDWARE/dev_key.c
        }
        else
        {
            //其他变化，不报松开
            key_debug("其他变化\r\n");
            if(key_chg_sta.sta == 0XFFFFFFFF)
            {
                //当前没键按下
                key_debug("无键\r\n");
                KeyCtrl.keysta = 0;
            }
        }

        KeyCtrl.delay = KEY_LONGPRESS_FRIST_DELAY;//2S  按规范定2S
        KeyCtrl.timeid = dev_get_timeID();//更新按键按下时间

    }

    //---处理卡键---  //卡键，不能响应其他按键，按键扫描跟处理还要继续修改 FIX
    if(KeyCtrl.keysta == 1)//有键按下
    {
        if(FUN_TIME_OVER == dev_querry_time(KeyCtrl.holdtime, KEY_HOLD_ERR_TIME))
        {
            if(KeyCtrl.holdflag==0)
            //dev_lcd_keywarm();
            KeyCtrl.holdflag = 1;//有键卡主
        }
    }
    else if(KeyCtrl.keysta == 0
            && KeyCtrl.holdflag == 1)
    {
        KeyCtrl.holdflag = 0;
    }

    //----处理长按键，
    if(KeyCtrl.longpress == 1//允许长按键
            &&KeyCtrl.holdflag == 0//没有卡键
      )
    {
        if(KeyCtrl.keysta == 1)//有键按下
        {
            //时间到
            if(FUN_TIME_OVER == dev_querry_time(KeyCtrl.timeid, KeyCtrl.delay))
            {
                if(KeyCtrl.lastkey != 0x01)//如果只有关机键按下，不报长按
                {
                    dev_key_write(KeyCtrl.lastkey);
                }

                KeyCtrl.timeid = dev_get_timeID();
                KeyCtrl.delay = KEY_LONGPRESS_OTHER_DELAY;
            }
        }
    }
    #if 0 /*xqy 2017-12-13*/
    //处理开关机键
    #ifndef COER_DEAL_ONOFF
    //处理开关机情况
    if(1 == dev_key_check_onoff())//on off 按下,必须保持一直按下才会执行开关机
    {
        if(onoff_sta == 0)//说明是第一次变化
        {
            key_debug("开关机按键按下\r\n");    
            onoff_sta = 1;
            timeid = dev_get_timeID();
        }
        else if(onoff_sta == 1)
        {
            //判断开挂机按键按住时间
            if(FUN_TIME_OVER == dev_querry_time(timeid, SYS_POWER_HOLD))//暂定2S开关机
            {
                key_debug("写入一个关机键\r\n");
                dev_key_wirte_power();
                onoff_sta = 3;
            }
        }
        else
        {
        
        }
    }
    else
    {
        onoff_sta = 0;    
    }
    #endif
    #endif


}

/****************************************************************************
**Description:      按键进入低功耗
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-4-28)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
void dev_key_sleep(void)
{
    //停止按键扫描
    dev_key_close();
    //配置按键中断唤醒
    //drv_key_sleep();
    
}

void dev_key_wakeup(void)
{
    dev_key_init();     //add by hecaiwen,2014.11.07,解决进入低功耗后，蓝牙唤醒出现"哔哔"叫的缺陷
   // drv_key_wakeup();
    dev_key_open();
}


/****************************************************************************
**Description:      检测开关键是否按下//直接检测，不用通过按键扫描?
**Input parameters:
**Output parameters:
**
**Returned value: 1 按下
**
**Created by:            hxj(2014-3-14)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_check_onoff(void)
{

    if((KeyCtrl.last_key_sta & (1 << (KeyPra[1].line_mask))) == 0)
    {
        return 1;
    }
    else
        return 0;

}

/****************************************************************************
**Description:      测试按键
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-10)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_test(void)
{
    u32 key;

    while(1)
    {
        //uart_printf("read\r\n");
        drv_key_scan();     //按键扫描
        dev_key_task();     //处理按键变化，

        
        dev_key_read(&key);
        //uart_printf("key:%08x\r\n", key);
        if(key !=0)
        {

            key_debug("key: %s ", &key_fun_tab[key&0x000000ff]);

            key = key>>8;
            if(key !=0)
            {
                key_debug("%s ", &key_fun_tab[key&0x000000ff]);
            }
            key = key>>8;
            if(key !=0)
            {
                key_debug("%s ", &key_fun_tab[key&0x000000ff]);
            }
            key = key>>8;
            if(key !=0)
            {
                key_debug("%s ", &key_fun_tab[key&0x000000ff]);
            }

            key_debug("--\r\n");
        }
    }
}

//----------------------DDI--------------------
#include "ddi.h"


s32 DdiKeyGd = -1;


s32 ddi_key_open (void)
{

    if(DdiKeyGd == -1)
    {
        dev_key_open();
        DdiKeyGd = 0;
    }
    return DDI_OK;
}

s32 ddi_key_close (void)
{
    ;

    if(DdiKeyGd == 0)
    {
        dev_key_close();
        DdiKeyGd = -1;
    }
    return DDI_OK;
}

s32 ddi_key_clear (void)
{
    ;

    if(DdiKeyGd == 0)
    {
        dev_key_clear();
        return DDI_OK;
    }
    else
    {
        return DDI_EIO;
    }

}

/****************************************************************************
**Description:
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-5-7)
**--------------------------------------------------------------------------
**Modified by:     2014.05.07 单键测试OK
**Modified by:
****************************************************************************/
s32 ddi_key_read (u32 *lpKey)
{
    u32 key, key_tmp;
    s32 ret = 0;

    //DEBUG_SHOW_FUN_NAME;

    *lpKey = 0;

    dev_key_read(&key);

    key_tmp = key;

    if(DdiKeyGd == -1)//设备未打开
    {
        //DevKeyDebug("设备未打开\r\n");
        return DDI_EIO;
    }
    if(key == 0)//无按键
    {
        return 0;
    }
    //统计按键个数
    if((key & 0xff) != 0)
    {
        ret++;
    }
    key = (key >> 8);

    if((key & 0xff) != 0)
    {
        ret++;
    }
    key = (key >> 8);

    if((key & 0xff) != 0)
    {
        ret++;
    }
    key = (key >> 8);

    if((key & 0xff) != 0)
    {
        ret++;
    }

    *lpKey = key_tmp;

    return ret;

}

/****************************************************************************
**Description:
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-5-7)
**--------------------------------------------------------------------------
**Modified by:      2014.05.07 测试OK
**Modified by:
****************************************************************************/
s32 ddi_key_ioctl(u32 nCmd, u32 lParam, u32 wParam)
{
    ;

    if(DdiKeyGd == -1)//设备为打开
    {
        return DDI_EIO;
    }

    return dev_key_ioctl(nCmd, lParam, wParam);
}




static const u32 keyfun[21]=
{
    0,
    0,    FUNCTION,    F1,    F2,
    '1', '2',  '3',   ALPHA,
    '4', '5',  '6',   ESC,
    '7', '8',  '9',   CLR,
    '*', '0',  '#',   ENTER,
};


/*
    在应用任务中调用，不需要扫描按键
    乱，，，，hxj 2015.06.13
*/
s32 dev_key_fun_read(u32 *fun_key)
{
    u32 key;

    dev_key_read(&key);

    if(
        ((key & 0x000000ff) != 0)
        && ((key & 0xffffff00) == 0)
    )//测试程序不处理多键
    {
        if(key == KEY_ONOFF_HOLD)
        {
            *fun_key = key;
            return 0;
        }

        //dev_buzzer_open(100);

        *fun_key = keyfun[key&0x000000ff];

    }
    else
        *fun_key = 0;

    return 0;
}








